Visual Studio -> ctrl+shift+N
-> проект сервера отчетов -> справа папка отчеты -> ctrl+shift+A - отчет

- папка слева --Источники данных правая клавиша мыши
добавить источники данных

- правка
-имя сервера --профидата
-Подключение к базе --i_collect

ok - ok

-слева набор данных -пкм - добавить

- галочка использовать набор данных, внедренный в отчет - выбираю источник
и тут пишу запрос

очень слева панель инструментов, выбираю как это выводить и перетаскиваю
поля перетаскиваю тоже


202321 --macros password