--МТС за весь период


SELECT

	d.contract 'CONTRACTNUM'
	,isnull(sum(cl.zvonki),'') 'Кол-во звонков'
	--,isnull(sum(cl.pisma),'') 'Кол-во писем'
	,isnull(sum(dl.letters),'') 'Кол-во писем'
	,isnull(sum(s.sms),'') 'Кол-во смс'
	,isnull(sum(cl.viezdi),'') 'Кол-во выездов'
	,isnull(sum(cl.zvonki_with_debtor),'') 'Кол-во контактов с должником'
	,isnull(sum(dp.kol_ob),'') 'Кол-во обещаний'
	,isnull(sum(dp2.miss_prom),'') 'Кол-во нарушенных обещаний'


FROM
	bank as b
	inner join portfolio as p on b.id = p.parent_id
	inner join debt as d on p.id = d.r_portfolio_id
	inner join person as per on d.parent_id = per.id

--гс, смс, письма, выезды
	left join
			(
			select 
				cl.r_debt_id
				,sum(case when cl.typ in (1,3) then 1 else 0 end) as zvonki
				,sum(case when (cl.typ in (1,3) and cl.result in (320712,320607,320616,320609,320714,320635,320704,320637)) then 1 else 0 end) zvonki_with_debtor
				,sum(case when (cl.typ = 2) then 1 else 0 end) as viezdi
				--,sum (case when (cl.typ = 6) then 1 else 0 end) as pisma
			from
				[i_collect].[dbo].[contact_log] as cl
			group by
				cl.r_debt_id

			)cl		on d.id = cl.r_debt_id

--letters
		left join
				(
				select
					dl.parent_id
					,count(dl.id) letters
				from
					debt_letter dl
				group by
					dl.parent_id
				)dl
					on dl.parent_id = d.id
			
--sms
	left join
			(
			select
				s.parent_id
				,sum((case when (s.status in (1,2,3,4,5,6,7,8,9)) then 1 else 0	end)) as sms
			from
				[i_collect].[dbo].[debt_sms] as s
			group by
				s.parent_id

			)s		on d.id = s.parent_id

/*promise*/
	left join 
			(
			select 
				dp.parent_id
				,count(dp.id) as kol_ob
			from 
				i_collect.dbo.debt_promise as dp
			group by
				dp.parent_id
			)dp
				on dp.parent_id = d.id

--нарушенные
	left join 
			(
			select 
				dp.parent_id
				,count(dp.id) as miss_prom
			from 
				i_collect.dbo.debt_promise as dp
			where
				dp.cover_sum = 0
				or dp.cover_sum is null
			group by
				dp.parent_id
			)dp2
				on dp2.parent_id = d.id

where
	d.contract in(
'8306/013720/10',
'МТСК56027757/810/11',
'МТСК54706504/810/12',
'002525',
'8303/017189/10',
'МТСКРС042912/810/12',
'МТСКДР019164/810/11',
'МТСК66046837/810/12',
'МТСК23068827/810/12',
'МТСК34103614/810/12',
'МТССЗФ033451/810/12',
'МТСК78138731/810/12',
'МТССЗФ055088/810/12',
'МТСМОБ053510/810/12',
'МТСК23230244/810/12',
'МТСК23229857/810/12',
'МТСК23219349/810/12',
'МТСК78309808/810/12',
'МТСК56320005/810/12',
'МТСК77618896/810/12',
'МТСК54359759/810/12',
'БСТ0001339706/810/13',
'МТСК24515307/810/12',
'МТСК56533618/810/12',
'МТСК23536781/810/12',
'МТСК78535571/810/12',
'МТСК23859697/810/12',
'МТСК56582481/810/12',
'МТСК23548765/810/12',
'МТСК77611297/810/12',
'МТСК23608337/810/12',
'МТСК58640298/810/12',
'МТСМСК193549/810/12',
'МТСК54637696/810/12',
'МТСК23702440/810/12',
'МТСК23670953/810/12',
'МТСК77713847/810/12',
'МТСК58755084/810/12',
'МТСК58749141/810/12',
'МТСК24732545/810/12',
'МТСК23782060/810/12',
'МТСК54742681/810/12',
'МТСК77787473/810/12',
'МТСК77807303/810/12',
'МТСК58847055/810/12',
'МТСК62871486/810/12',
'МТСК77870428/810/12',
'МТСКРС293610/810/12',
'МТСК78666264/810/12',
'МТСК58845625/810/12',
'МТСК58851090/810/12',
'ПННЧЛБ27200/810/12',
'МТСК24902464/810/12',
'МТСК77900767/810/12',
'МТСК78890899/810/12',
'МТСК02043769/810/13',
'МТСРСТ231616/810/14',
'МТСНВС012898/810/13',
'МТСК23636443/810/12',
'МТСК77017201/810/13',
'МТСК77112145/810/13',
'МТСК58070364/810/13',
'МТСК54077054/810/13',
'МТСК18132242/810/13',
'МТСК77149726/810/13',
'МТСК58549330/810/13',
'МТСК24191425/810/13',
'МТСК23668658/810/12',
'МТСК58162297/810/13',
'МТСК24162365/810/13',
'МТСК24228881/810/13',
'МТСК66229736/810/13',
'МТСК23229724/810/13',
'МТСК24229200/810/13',
'МТСК77445055/810/13',
'МТСК77262213/810/13',
'МТСК77089387/810/13',
'МТСК78276613/810/13',
'МТСК78276110/810/13',
'МТСЕКТ247413/810/14',
'МТСК66250832/810/13',
'МТСК54264919/810/13',
'МТСК77043555/810/13',
'МТСК77279692/810/13',
'МТСК78316882/810/13',
'МТСК63347495/810/13',
'МТСК64621434/810/13',
'МТСК23360740/810/13',
'МТСК58361648/810/13',
'МТСК77378949/810/13',
'МТССЗФ184346/810/13',
'МТСК77369596/810/13',
'МТСК77338086/810/13',
'БСТ0001308346/810/13',
'МТСК23205956/810/13',
'ТК0001419564/810/13',
'МТСК66814174/810/12',
'МТСК54726232/810/12',
'МТСНВС138353/810/13',
'МТСК23666571/810/13',
'МТСК23411740/810/13',
'МТСУФА227117/810/14',
'МТСРСТ269018/810/14',
'МТСРСТ274371/810/14',
'МТСК58847242/810/12',
'МТСМСК249346/810/14',
'8303/001392/10',
'МТСУФА113691/810/12',
'МТСНВС424815/810/14',
'МТСК23655069/810/12',
'МТСК77165735/810/13',
'МТСК58089154/810/13',
'МТСЕКТ118235/810/12',
'МТСК66501131/810/13',
'МТСК58501556/810/13',
'МТСК23499856/810/13',
'МТСК78508914/810/13',
'МТСК78667502/810/13',
'МТСК36653179/810/13',
'МТСК23659901/810/13',
'МТСК02654287/810/13',
'МТСК24710606/810/12',
'МТСК77407240/810/13',
'МТСК78493245/810/13',
'МТСК58499183/810/13',
'МТСК02502820/810/13',
'БСТ0001457440/810/13',
'МТСК66585232/810/13',
'МТСК02630020/810/13',
'МТСК24507112/810/13',
'МТСК72506344/810/13',
'МТСК58487644/810/13',
'МТСК54038591/810/14',
'МТСК36468356/810/13',
'МТСК36036600/810/14',
'МТСК02007823/810/14',
'МТСК58499940/810/13',
'МТСК54006812/810/12',
'МТСМСК212941/810/14',
'МТСК77105605/810/13',
'МТСК77805874/810/12',
'Ф-015-ДО-01/88396',
'МТСК77524753/810/13',
'МТСК23543394/810/13',
'МТСК74063559/810/14',
'МТСК27061168/810/14',
'МТСМСК412362/810/14',
'МТСНВС381735/810/14',
'МТСК77529351/810/12',
'МТСК23089181/810/14',
'МТСУФА000194/810/15',
'ПННСЗФ10999/810/13',
'МТСК23683733/810/13',
'МТСРСТ357899/810/14',
'МТСК23092420/810/14',
'МТСК23629941/810/12',
'МТСК77649901/810/12',
'МТСК23027801/810/14',
'БСТ0001602675/810/13',
'МТСК78579958/810/13',
'МТСМСК172062/810/14',
'МТСК77630878/810/13',
'БСТ0001683390/810/13',
'МТСК58753426/810/12',
'МТСК36555783/810/13',
'МТСК25603653/810/13',
'МТСК77654403/810/12',
'МТСРСТ206789/810/14',
'МТСЕКТ212748/810/14',
'МТСМСК245079/810/14',
'МТСРСТ235197/810/14',
'МТСК78656693/810/12',
'МТСМСК226827/810/14',
'МТСУФА258935/810/14',
'МТСНВС258752/810/14',
'МТСУФА220684/810/14',
'МТСРСТ305823/810/14',
'МТСК36427065/810/13',
'МТССЗФ360855/810/14',
'МТСК66242397/810/13',
'МТСК77203662/810/12',
'МТСУФА300434/810/14',
'МТСМСК277687/810/14',
'МТСУФА290394/810/14',
'МТСЕКТ286345/810/14',
'МТСНВС287429/810/14',
'МТСМСК033154/810/13',
'МТСК77904978/810/12',
'МТСРСТ325060/810/14',
'МТСМСК338929/810/14',
'МТСРСТ384315/810/14',
'МТСУФА340015/810/14',
'МТСЕКТ329921/810/14',
'МТСУФА330892/810/14',
'МТСЕКТ359462/810/13',
'МТСМСК001011/810/15',
'МТСМСК418838/810/14',
'МТСЕКТ001694/810/15',
'МТСК77604655/810/12',
'МТСК55479711/810/13',
'МТСК50215663/810/13',
'МТСК36618745/810/13',
'МТСУФА353364/810/13',
'МТСНВС375270/810/14',
'МТСНВС389872/810/14',
'МТСУФА356998/810/14',
'МТСК54372227/810/13',
'МТСК36464370/810/13',
'Ф-022-ОО-73/144406',
'Ф-022-ОО-64/132899',
'МТСК77892067/810/12',
'МТСК66498405/810/13',
'МТСЕКТ356065/810/14'
)


group by
	d.contract

